smileym4n-collab/ESP32S3I2S/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# Both supported build profiles use 8 MB flash. The application does not need
# PSRAM; leaving it disabled is essential for the N8R8 audio-test profile.
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# CONFIG_SPIRAM is not set

# Keep USB audio and I2S service latency predictable.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# Espressif's TinyUSB-based USB Audio Class device component.
CONFIG_UAC_TUSB_MANUFACTURER="Custom"
CONFIG_UAC_TUSB_PRODUCT="Tom Watson Audio"
CONFIG_UAC_TUSB_SERIAL_NUM="TOMWATSONAUDIO001"
CONFIG_UAC_SPEAKER_CHANNEL_NUM=2
CONFIG_UAC_MIC_CHANNEL_NUM=0
CONFIG_UAC_SAMPLE_RATE=48000
CONFIG_UAC_SPK_INTERVAL_MS=10
CONFIG_UAC_SPK_NEW_PLAY_INTERVAL=100
CONFIG_UAC_SUPPORT_MACOS=y
CONFIG_UAC_TINYUSB_TASK_PRIORITY=7
CONFIG_UAC_SPK_TASK_PRIORITY=7

# The vendored usb_device_uac component owns the TinyUSB descriptors.
CONFIG_USB_DEVICE_UAC_AS_PART=n

# Local firmware audio defaults for the USB Audio Class to I2S PCB.
CONFIG_AUDIO_SAMPLE_RATE_48000=y
CONFIG_AUDIO_I2S_BCLK_GPIO=4
CONFIG_AUDIO_I2S_WS_GPIO=5
CONFIG_AUDIO_I2S_DATA_GPIO=6
CONFIG_AUDIO_I2S_MCLK_GPIO=15
CONFIG_AUDIO_OSC_SELECT_GPIO=7
CONFIG_BOARD_I2C_SDA_GPIO=8
CONFIG_BOARD_I2C_SCL_GPIO=9
CONFIG_BOARD_ATTINY_UART_TX_GPIO=10
CONFIG_BOARD_VBUS_SENSE_GPIO=13
CONFIG_BOARD_MUTE_GPIO=35
CONFIG_BOARD_RATE_F3_GPIO=36
CONFIG_BOARD_RATE_F2_GPIO=37
CONFIG_BOARD_RATE_F1_GPIO=38
CONFIG_BOARD_RATE_F0_GPIO=39
# CONFIG_AUDIO_I2S_BCLK_INVERT is not set
# CONFIG_AUDIO_I2S_WS_INVERT is not set
CONFIG_AUDIO_I2S_DMA_DESC_NUM=8
CONFIG_AUDIO_I2S_DMA_FRAME_NUM=240
CONFIG_AUDIO_STREAM_BUFFER_MS=128
CONFIG_AUDIO_PREFILL_MS=40
CONFIG_AUDIO_IDLE_STOP_MS=1000
